import uuid from 'react-uuid';

export type arrayCompanyType = Array<{
  id: string;
  title: string;
  links: Array<{ id: string; text: string }>;
}>;

export const arrayCompany: arrayCompanyType = [
  {
    id: uuid(),
    title: 'Управляющая компания',
    links: [
      {
        id: uuid(),
        text: 'Участок №1',
      },

      {
        id: uuid(),
        text: 'Участок №2',
      },

      {
        id: uuid(),
        text: 'Участок №3',
      },

      {
        id: uuid(),
        text: 'Участок №4',
      },

      {
        id: uuid(),
        text: 'Участок №5',
      },

      {
        id: uuid(),
        text: 'Участок №6',
      },

      {
        id: uuid(),
        text: 'Участок №7',
      },

      {
        id: uuid(),
        text: 'Участок №8',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Водоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Водоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Электроснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Газоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Водоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Водоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Электроснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Газоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Водоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Водоснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },

  {
    id: uuid(),
    title: 'Электроснабжение',
    links: [
      {
        id: uuid(),
        text: 'Горячая линия горводоканала',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Центральная диспетчерская служба',
      },

      {
        id: uuid(),
        text: 'Установка, замена индивидуальных приборов учета воды',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },

      {
        id: uuid(),
        text: 'Системы водоснабжения',
      },
    ],
  },
];
